ERM/src/Documents/РучнаяКорректировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>РучнаяКорректировка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Agreement</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/InformationRegisters/КлючиДетальныхРучныхКорректировок/КлючиДетальныхРучныхКорректировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючиДетальныхРучныхКорректировок</name>
  <resources>
    <name>РучнаяКорректировка</name>
    <type>
      <types>DocumentRef.РучнаяКорректировка</types>
    </type>
  </resources>
  <dimensions>
    <name>Source</name>
    <type>
      <types>EnumRef.ТипыСоответствий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Journal</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>LineNbr</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/InformationRegisters/КлючиРучныхКорректировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>КлючиРучныхКорректировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РучнаяКорректировкаLawson</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubGeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Enums/ТипыСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСоответствий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Lawson</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleSmith</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HOBs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьCRM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьParentClients</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sun</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Documents/РучнаяКорректировка/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		Если Source = Перечисления.ТипыСоответствий.Lawson ИЛИ Source = Перечисления.ТипыСоответствий.HOBs Тогда
			ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
				"Source, Company, JournalLawson, LineNbrLawson, Дата"));
		ИначеЕсли Source = Перечисления.ТипыСоответствий.OracleMI ИЛИ Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
			
			ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
				"Source, Company, JournalLawson, Дата"));
			
		Иначе
			ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
				"Source, Company, Client, Location, SubSubSegment, AU, Account, Currency"));
				//"Source, Company, Location, SubSubSegment, AU, Account, Currency"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		
		Если Source = Перечисления.ТипыСоответствий.Lawson ИЛИ Source = Перечисления.ТипыСоответствий.HOBs ИЛИ Source = Перечисления.ТипыСоответствий.OracleMI ИЛИ Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
			
			Если СтарыеЗначенияКлючей.Source <> Source ИЛИ СтарыеЗначенияКлючей.Company <> Company
				ИЛИ СтарыеЗначенияКлючей.JournalLawson <> JournalLawson 
				ИЛИ (Source <> Перечисления.ТипыСоответствий.OracleMI И СтарыеЗначенияКлючей.LineNbrLawson <> LineNbrLawson) 
				ИЛИ СтарыеЗначенияКлючей.Дата <> Дата Тогда
				
				НЗ = РегистрыСведений.КлючиДетальныхРучныхКорректировок.СоздатьНаборЗаписей();
				НЗ.Отбор.Source.Установить(СтарыеЗначенияКлючей.Source);
				НЗ.Отбор.Company.Установить(СтарыеЗначенияКлючей.Company);
				НЗ.Отбор.Journal.Установить(СтарыеЗначенияКлючей.JournalLawson);
				Если Source <> Перечисления.ТипыСоответствий.OracleMI И Source <> Перечисления.ТипыСоответствий.OracleSmith Тогда
					НЗ.Отбор.LineNbr.Установить(СтарыеЗначенияКлючей.LineNbrLawson);
				КонецЕсли;
				НЗ.Отбор.Date.Установить(СтарыеЗначенияКлючей.Дата);
				НЗ.Записать(Истина);
				
				НЗ.Отбор.Source.Установить(Source);
				НЗ.Отбор.Company.Установить(Company);
				НЗ.Отбор.Journal.Установить(JournalLawson);
				Если Source <> Перечисления.ТипыСоответствий.OracleMI И Source <> Перечисления.ТипыСоответствий.OracleSmith Тогда
					НЗ.Отбор.LineNbr.Установить(LineNbrLawson);
				КонецЕсли;
				НЗ.Отбор.Date.Установить(Дата);
				ЗаписьНабора = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
				ЗаписьНабора.Journal = JournalLawson;
				Если Source <> Перечисления.ТипыСоответствий.OracleMI И Source <> Перечисления.ТипыСоответствий.OracleSmith Тогда
					ЗаписьНабора.LineNbr = LineNbrLawson;
				КонецЕсли;
				ЗаписьНабора.РучнаяКорректировка = Ссылка;
				НЗ.Записать(Истина);
				
			КонецЕсли;
			
		Иначе
			
			Если СтарыеЗначенияКлючей.Source <> Source ИЛИ СтарыеЗначенияКлючей.Company <> Company
				ИЛИ СтарыеЗначенияКлючей.Client <> Client 
				ИЛИ СтарыеЗначенияКлючей.Location <> Location
				ИЛИ СтарыеЗначенияКлючей.SubSubSegment <> SubSubSegment
				ИЛИ СтарыеЗначенияКлючей.AU <> AU 
				ИЛИ СтарыеЗначенияКлючей.Account <> Account 
				ИЛИ СтарыеЗначенияКлючей.Currency <> Currency Тогда
					
				НЗ = РегистрыСведений.КлючиРучныхКорректировок.СоздатьНаборЗаписей();
				НЗ.Отбор.Source.Установить(СтарыеЗначенияКлючей.Source);
				НЗ.Отбор.Company.Установить(СтарыеЗначенияКлючей.Company);
				НЗ.Отбор.Client.Установить(СтарыеЗначенияКлючей.Client);
				НЗ.Отбор.Location.Установить(СтарыеЗначенияКлючей.Location);
				НЗ.Отбор.SubSubSegment.Установить(СтарыеЗначенияКлючей.SubSubSegment);
				НЗ.Отбор.AU.Установить(СтарыеЗначенияКлючей.AU);
				НЗ.Отбор.Account.Установить(СтарыеЗначенияКлючей.Account);
				НЗ.Отбор.Currency.Установить(СтарыеЗначенияКлючей.Currency);
				НЗ.Записать(Истина);
					
				НЗ.Отбор.Source.Установить(Source);
				НЗ.Отбор.Company.Установить(Company);
				НЗ.Отбор.Client.Установить(Client);
				НЗ.Отбор.Location.Установить(Location);
				НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
				НЗ.Отбор.AU.Установить(AU);
				НЗ.Отбор.Account.Установить(Account);
				НЗ.Отбор.Currency.Установить(Currency);
				ЗаписьНабора = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
				ЗаписьНабора.РучнаяКорректировка = Ссылка;
				НЗ.Записать(Истина);
					
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Source = Перечисления.ТипыСоответствий.Lawson ИЛИ Source = Перечисления.ТипыСоответствий.HOBs ИЛИ Source = Перечисления.ТипыСоответствий.OracleMI ИЛИ Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
			
			НЗ = РегистрыСведений.КлючиДетальныхРучныхКорректировок.СоздатьНаборЗаписей();
			НЗ.Отбор.Source.Установить(Source);
			НЗ.Отбор.Company.Установить(Company);
			НЗ.Отбор.Journal.Установить(JournalLawson);
			Если Source <> Перечисления.ТипыСоответствий.OracleMI И Source <> Перечисления.ТипыСоответствий.OracleSmith Тогда
				НЗ.Отбор.LineNbr.Установить(LineNbrLawson);
			КонецЕсли;
			НЗ.Отбор.Date.Установить(Дата);
			ЗаписьНабора = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
			ЗаписьНабора.Journal = JournalLawson;
			Если Source <> Перечисления.ТипыСоответствий.OracleMI И Source <> Перечисления.ТипыСоответствий.OracleSmith Тогда
				ЗаписьНабора.LineNbr = LineNbrLawson;
			КонецЕсли;
			ЗаписьНабора.РучнаяКорректировка = Ссылка;
			НЗ.Записать(Истина);
			
		Иначе
			
			НЗ = РегистрыСведений.КлючиРучныхКорректировок.СоздатьНаборЗаписей();
			НЗ.Отбор.Source.Установить(Source);
			НЗ.Отбор.Company.Установить(Company);
			НЗ.Отбор.Client.Установить(Client);
			НЗ.Отбор.Location.Установить(Location);
			НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
			НЗ.Отбор.AU.Установить(AU);
			НЗ.Отбор.Account.Установить(Account);
			НЗ.Отбор.Currency.Установить(Currency);
			ЗаписьНабора = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
			ЗаписьНабора.РучнаяКорректировка = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	НЗ = РегистрыСведений.КлючиРучныхКорректировок.СоздатьНаборЗаписей();
	НЗ.Отбор.Source.Установить(Source);
	НЗ.Отбор.Company.Установить(Company);
	НЗ.Отбор.Client.Установить(Client);
	НЗ.Отбор.Location.Установить(Location);
	НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
	НЗ.Отбор.AU.Установить(AU);
	НЗ.Отбор.Account.Установить(Account);
	НЗ.Отбор.Currency.Установить(Currency);
	НЗ.Записать(Истина);
	
КонецПроцедуры

#КонецЕсли
